ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/hal_lld_f105_f107.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @defgroup STM32F10X_CL_HAL STM32F105/F107 HAL Support
 * @details HAL support for STM32 Connectivity Line sub-family.
 *
 * @ingroup HAL
 */

/**
 * @file    GD32VF103/hal_lld_f105_f107.h
 * @brief   STM32F10x Connectivity Line HAL subsystem low level driver header.
 *
 * @addtogroup STM32F10X_CL_HAL
 * @{
 */

#ifndef _HAL_LLD_F105_F107_H_
#define _HAL_LLD_F105_F107_H_

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
/**
 * @brief   Maximum system clock frequency.
 */
#define GD32_SYSCLK_MAX        72000000

/**
 * @brief   Maximum HXTAL clock frequency.
 */
#define GD32_HXTALCLK_MAX        50000000

/**
 * @brief   Minimum HXTAL clock frequency.
 */
#define GD32_HXTALCLK_MIN        1000000

/**
 * @brief   Maximum LXTAL clock frequency.
 */
#define GD32_LXTALCLK_MAX        1000000

/**
 * @brief   Minimum LXTAL clock frequency.
 */
#define GD32_LXTALCLK_MIN        32768

/**
 * @brief   Maximum PLLs input clock frequency.
 */
#define GD32_PLL1IN_MAX        12000000

/**
 * @brief   Minimum PLL1 input clock frequency.
 */
#define GD32_PLL1IN_MIN        3000000

/**
 * @brief   Maximum PLL1 input clock frequency.
 */
#define GD32_PLL23IN_MAX       5000000

/**
 * @brief   Minimum PLL2 and PLL3 input clock frequency.
 */
#define GD32_PLL23IN_MIN       3000000

/**
 * @brief   Maximum PLL1 VCO clock frequency.
 */
#define GD32_PLL1VCO_MAX       144000000

/**
 * @brief   Minimum PLL1 VCO clock frequency.
 */
#define GD32_PLL1VCO_MIN       36000000

/**
 * @brief   Maximum PLL2 and PLL3 VCO clock frequency.
 */
#define GD32_PLL23VCO_MAX      148000000

/**
 * @brief   Minimum PLL2 and PLL3 VCO clock frequency.
 */
#define GD32_PLL23VCO_MIN      80000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define GD32_PCLK1_MAX         36000000

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define GD32_PCLK2_MAX         72000000

/**
 * @brief   Maximum ADC clock frequency.
 */
#define GD32_ADCCLK_MAX        14000000

/**
 * @brief   Maximum SPI/I2S clock frequency.
 */
#define GD32_SPII2S_MAX        18000000
/** @} */

/**
 * @name    RCU_CFG0 register bits definitions
 * @{
 */
#define GD32_SCS_IRC8M            (0 << 0)    /**< SYSCLK source is IRC8M.      */
#define GD32_SCS_HXTAL            (1 << 0)    /**< SYSCLK source is HXTAL.      */
#define GD32_SCS_PLL            (2 << 0)    /**< SYSCLK source is PLL.      */

#define GD32_AHBPSC_DIV1         (0 << 4)    /**< SYSCLK divided by 1.       */
#define GD32_AHBPSC_DIV2         (8 << 4)    /**< SYSCLK divided by 2.       */
#define GD32_AHBPSC_DIV4         (9 << 4)    /**< SYSCLK divided by 4.       */
#define GD32_AHBPSC_DIV8         (10 << 4)   /**< SYSCLK divided by 8.       */
#define GD32_AHBPSC_DIV16        (11 << 4)   /**< SYSCLK divided by 16.      */
#define GD32_AHBPSC_DIV64        (12 << 4)   /**< SYSCLK divided by 64.      */
#define GD32_AHBPSC_DIV128       (13 << 4)   /**< SYSCLK divided by 128.     */
#define GD32_AHBPSC_DIV256       (14 << 4)   /**< SYSCLK divided by 256.     */
#define GD32_AHBPSC_DIV512       (15 << 4)   /**< SYSCLK divided by 512.     */

#define GD32_APB1PSC_DIV1        (0 << 8)    /**< HCLK divided by 1.         */
#define GD32_APB1PSC_DIV2        (4 << 8)    /**< HCLK divided by 2.         */
#define GD32_APB1PSC_DIV4        (5 << 8)    /**< HCLK divided by 4.         */
#define GD32_APB1PSC_DIV8        (6 << 8)    /**< HCLK divided by 8.         */
#define GD32_APB1PSC_DIV16       (7 << 8)    /**< HCLK divided by 16.        */

#define GD32_APB2PSC_DIV1        (0 << 11)   /**< HCLK divided by 1.         */
#define GD32_APB2PSC_DIV2        (4 << 11)   /**< HCLK divided by 2.         */
#define GD32_APB2PSC_DIV4        (5 << 11)   /**< HCLK divided by 4.         */
#define GD32_APB2PSC_DIV8        (6 << 11)   /**< HCLK divided by 8.         */
#define GD32_APB2PSC_DIV16       (7 << 11)   /**< HCLK divided by 16.        */

#define GD32_ADCPSC_DIV2       (0 << 14)   /**< PPRE2 divided by 2.        */
#define GD32_ADCPSC_DIV4       (1 << 14)   /**< PPRE2 divided by 4.        */
#define GD32_ADCPSC_DIV6       (2 << 14)   /**< PPRE2 divided by 6.        */
#define GD32_ADCPSC_DIV8       (3 << 14)   /**< PPRE2 divided by 8.        */

#define GD32_PLLSEL_IRC8M        (0 << 16)   /**< PLL clock source is IRC8M.   */
#define GD32_PLLSEL_PREDIV1    (1 << 16)   /**< PLL clock source is
                                                 PREDIV1.                   */

#define GD32_USBFSPRE_DIV2     (1 << 22)   /**< HCLK*2 divided by 2.       */
#define GD32_USBFSPRE_DIV3     (0 << 22)   /**< HCLK*2 divided by 3.       */

#define GD32_CKOUT0SEL_NOCLOCK    (0 << 24)   /**< No clock on MCO pin.       */
#define GD32_CKOUT0SEL_SYSCLK     (4 << 24)   /**< SYSCLK on MCO pin.         */
#define GD32_CKOUT0SEL_IRC8M        (5 << 24)   /**< IRC8M clock on MCO pin.      */
#define GD32_CKOUT0SEL_HXTAL        (6 << 24)   /**< HXTAL clock on MCO pin.      */
#define GD32_CKOUT0SEL_PLLDIV2    (7 << 24)   /**< PLL/2 clock on MCO pin.    */
#define GD32_CKOUT0SEL_PLL2       (8 << 24)   /**< PLL2 clock on MCO pin.     */
#define GD32_CKOUT0SEL_PLL3DIV2   (9 << 24)   /**< PLL3/2 clock on MCO pin.   */
#define GD32_CKOUT0SEL_XT1        (10 << 24)  /**< XT1 clock on MCO pin.      */
#define GD32_CKOUT0SEL_PLL3       (11 << 24)  /**< PLL3 clock on MCO pin.     */
/** @} */

/**
 * @name    RCU_BDCR register bits definitions
 * @{
 */
#define GD32_RTCSEL_MASK       (3 << 8)    /**< RTC clock source mask.     */
#define GD32_RTCSEL_NOCLOCK    (0 << 8)    /**< No clock.                  */
#define GD32_RTCSEL_LXTAL        (1 << 8)    /**< LXTAL used as RTC clock.     */
#define GD32_RTCSEL_IRC40K        (2 << 8)    /**< IRC40K used as RTC clock.     */
#define GD32_RTCSEL_HXTALDIV     (3 << 8)    /**< HXTAL divided by 128 used as
                                                 RTC clock.                 */
/** @} */

/**
 * @name    RCU_CFG02 register bits definitions
 * @{
 */
#define GD32_PREDIV1SRC_HXTAL    (0 << 16)   /**< PREDIV1 source is HXTAL.     */
#define GD32_PREDIV1SRC_PLL2   (1 << 16)   /**< PREDIV1 source is PLL2.    */
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Main clock source selection.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_SCS) || defined(__DOXYGEN__)
#define GD32_SCS                    GD32_SCS_PLL
#endif

/**
 * @brief   Clock source for the PLL.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PLLSEL) || defined(__DOXYGEN__)
#define GD32_PLLSEL                GD32_PLLSEL_PREDIV1
#endif

/**
 * @brief   PREDIV1 clock source.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PREDIV1SRC) || defined(__DOXYGEN__)
#define GD32_PREDIV1SRC            GD32_PREDIV1SRC_HXTAL
#endif

/**
 * @brief   PREDIV1 division factor.
 * @note    The allowed range is 1...16.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PREDIV1_VALUE) || defined(__DOXYGEN__)
#define GD32_PREDIV1_VALUE         5
#endif

/**
 * @brief   PLL multiplier value.
 * @note    The allowed range is 4...9.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PLLMF_VALUE) || defined(__DOXYGEN__)
#define GD32_PLLMF_VALUE          9
#endif

/**
 * @brief   PREDIV2 division factor.
 * @note    The allowed range is 1...16.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PREDIV2_VALUE) || defined(__DOXYGEN__)
#define GD32_PREDIV2_VALUE         5
#endif

/**
 * @brief   PLL2 multiplier value.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PLL2MUL_VALUE) || defined(__DOXYGEN__)
#define GD32_PLL2MUL_VALUE         8
#endif

/**
 * @brief   PLL3 multiplier value.
 * @note    The default value is calculated for a 50MHz clock from
 *          a 25MHz crystal.
 */
#if !defined(GD32_PLL3MUL_VALUE) || defined(__DOXYGEN__)
#define GD32_PLL3MUL_VALUE         10
#endif

/**
 * @brief   AHB prescaler value.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 25MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_AHBPSC) || defined(__DOXYGEN__)
#define GD32_AHBPSC                  GD32_AHBPSC_DIV1
#endif

/**
 * @brief   APB1 prescaler value.
 */
#if !defined(GD32_APB1PSC) || defined(__DOXYGEN__)
#define GD32_APB1PSC                 GD32_APB1PSC_DIV2
#endif

/**
 * @brief   APB2 prescaler value.
 */
#if !defined(GD32_APB2PSC) || defined(__DOXYGEN__)
#define GD32_APB2PSC                 GD32_APB2PSC_DIV2
#endif

/**
 * @brief   ADC prescaler value.
 */
#if !defined(GD32_ADCPSC) || defined(__DOXYGEN__)
#define GD32_ADCPSC                GD32_ADCPSC_DIV4
#endif

/**
 * @brief   USB clock setting.
 */
#if !defined(GD32_USBFS_CLOCK_REQUIRED) || defined(__DOXYGEN__)
#define GD32_USBFS_CLOCK_REQUIRED    TRUE
#endif

/**
 * @brief   OTG prescaler initialization.
 */
#if !defined(GD32_USBFSPRE) || defined(__DOXYGEN__)
#define GD32_USBFSPRE              GD32_USBFSPRE_DIV3
#endif

/**
 * @brief   Dedicated I2S clock setting.
 */
#if !defined(GD32_I2S_CLOCK_REQUIRED) || defined(__DOXYGEN__)
#define GD32_I2S_CLOCK_REQUIRED    FALSE
#endif

/**
 * @brief   MCO pin setting.
 */
#if !defined(GD32_CKOUT0SEL) || defined(__DOXYGEN__)
#define GD32_CKOUT0SEL                   GD32_CKOUT0SEL_NOCLOCK
#endif

/**
 * @brief   RTC clock source.
 */
#if !defined(GD32_RTCSEL) || defined(__DOXYGEN__)
#define GD32_RTCSEL                   GD32_RTCSEL_HXTALDIV
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

