ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/hal_lld_f105_f107.h
/*
 * Configuration-related checks.
 */
/*#if !defined(STM32F107_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F107_MCUCONF not defined"
#endif*/

/*
 * IRC8M related checks.
 */
#if GD32_IRC8M_ENABLED
#else /* !GD32_IRC8M_ENABLED */

#if GD32_SCS == GD32_SCS_IRC8M
#error "IRC8M not enabled, required by GD32_SCS"
#endif

#if (GD32_SCS == GD32_SCS_PLL) && (GD32_PLLSEL == GD32_PLLSEL_IRC8M)
#error "IRC8M not enabled, required by GD32_SCS and GD32_PLLSEL"
#endif

#if (GD32_CKOUT0SEL == GD32_CKOUT0SEL_IRC8M) ||                                   \
    ((GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLLDIV2) &&                              \
     (GD32_PLLSEL == GD32_PLLSEL_IRC8M))
#error "IRC8M not enabled, required by GD32_CKOUT0SEL"
#endif

#endif /* !GD32_IRC8M_ENABLED */

/*
 * HXTAL related checks.
 */
#if GD32_HXTAL_ENABLED

#if GD32_HXTALCLK == 0
#error "HXTAL frequency not defined"
#elif (GD32_HXTALCLK < GD32_HXTALCLK_MIN) || (GD32_HXTALCLK > GD32_HXTALCLK_MAX)
#error "GD32_HXTALCLK outside acceptable range (GD32_HXTALCLK_MIN...GD32_HXTALCLK_MAX)"
#endif

#else /* !GD32_HXTAL_ENABLED */

#if GD32_SCS == GD32_SCS_HXTAL
#error "HXTAL not enabled, required by GD32_SCS"
#endif

#if (GD32_SCS == GD32_SCS_PLL) && (GD32_PLLSEL == GD32_PLLSEL_PREDIV1)
#error "HXTAL not enabled, required by GD32_SCS and GD32_PLLSEL"
#endif

#if (GD32_CKOUT0SEL == GD32_CKOUT0SEL_HXTAL) ||                                   \
    (((GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLLDIV2) ||                             \
      (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLL2) ||                                \
      (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLL3) ||                                \
      (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLL3DIV2)) &&                           \
     (GD32_PLLSEL == GD32_PLLSEL_HXTAL)) ||                                 \
    (GD32_CKOUT0SEL == GD32_CKOUT0SEL_XT1)
#error "HXTAL not enabled, required by GD32_CKOUT0SEL"
#endif

#if GD32_RTCSEL == GD32_RTCSEL_HXTALDIV
#error "HXTAL not enabled, required by GD32_RTCSEL"
#endif

#endif /* !GD32_HXTAL_ENABLED */

/*
 * IRC40K related checks.
 */
#if GD32_IRC40K_ENABLED
#else /* !GD32_IRC40K_ENABLED */

#if GD32_RTCSEL == GD32_RTCSEL_IRC40K
#error "IRC40K not enabled, required by GD32_RTCSEL"
#endif

#endif /* !GD32_IRC40K_ENABLED */

/*
 * LXTAL related checks.
 */
#if GD32_LXTAL_ENABLED

#if (GD32_LXTALCLK == 0)
#error "LXTAL frequency not defined"
#endif

#if (GD32_LXTALCLK < GD32_LXTALCLK_MIN) || (GD32_LXTALCLK > GD32_LXTALCLK_MAX)
#error "GD32_LXTALCLK outside acceptable range (GD32_LXTALCLK_MIN...GD32_LXTALCLK_MAX)"
#endif

#else /* !GD32_LXTAL_ENABLED */

#if GD32_RTCSEL == GD32_RTCSEL_LXTAL
#error "LXTAL not enabled, required by GD32_RTCSEL"
#endif

#endif /* !GD32_LXTAL_ENABLED */

/* PLL1 activation conditions.*/
#if GD32_USBFS_CLOCK_REQUIRED ||                                             \
    (GD32_SCS == GD32_SCS_PLL) ||                                           \
    (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLLDIV2) ||                               \
    defined(__DOXYGEN__)
/**
 * @brief   PLL1 activation flag.
 */
#define GD32_ACTIVATE_PLL1         TRUE
#else
#define GD32_ACTIVATE_PLL1         FALSE
#endif

/* PLL2 activation conditions.*/
#if ((GD32_PREDIV1SRC == GD32_PREDIV1SRC_PLL2) && GD32_ACTIVATE_PLL1) || \
    (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLL2) || defined(__DOXYGEN__)
/**
 * @brief   PLL2 activation flag.
 */
#define GD32_ACTIVATE_PLL2         TRUE
#else
#define GD32_ACTIVATE_PLL2         FALSE
#endif

/* PLL3 activation conditions.*/
#if GD32_I2S_CLOCK_REQUIRED ||                                             \
    (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLL3DIV2) ||                              \
    (GD32_CKOUT0SEL == GD32_CKOUT0SEL_PLL3) ||                                  \
    defined(__DOXYGEN__)
/**
 * @brief   PLL3 activation flag.
 */
#define GD32_ACTIVATE_PLL3         TRUE
#else
#define GD32_ACTIVATE_PLL3         FALSE
#endif

/**
 * @brief   PREDIV1 field.
 */
#if (GD32_PREDIV1_VALUE >= 1) && (GD32_PREDIV1_VALUE <= 16) ||            \
    defined(__DOXYGEN__)
#define GD32_PREDIV1               ((GD32_PREDIV1_VALUE - 1) << 0)
#else
#error "invalid GD32_PREDIV1_VALUE value specified"
#endif

/**
 * @brief   PREDIV2 field.
 */
#if (GD32_PREDIV2_VALUE >= 1) && (GD32_PREDIV2_VALUE <= 16) ||            \
    defined(__DOXYGEN__)
#define GD32_PREDIV2               ((GD32_PREDIV2_VALUE - 1) << 4)
#else
#error "invalid GD32_PREDIV2_VALUE value specified"
#endif

/**
 * @brief   PLLMUL field.
 */
/*#if ((GD32_PLLMF_VALUE >= 4) && (GD32_PLLMF_VALUE <= 9)) ||             \
    defined(__DOXYGEN__)
#define GD32_PLLMF                ((GD32_PLLMF_VALUE - 2) << 18)
#else
#error "invalid GD32_PLLMF_VALUE value specified"
#endif*/

/**
 * @brief   PLL2MUL field.
 */
#if ((GD32_PLL2MUL_VALUE >= 8) && (GD32_PLL2MUL_VALUE <= 14)) ||          \
    defined(__DOXYGEN__)
#define GD32_PLL2MUL               ((GD32_PLL2MUL_VALUE - 2) << 8)
#elif (GD32_PLL2MUL_VALUE == 16)
#define GD32_PLL2MUL               (14 << 8)
#elif (GD32_PLL2MUL_VALUE == 20)
#define GD32_PLL2MUL               (15 << 8)
#else
#error "invalid GD32_PLL2MUL_VALUE value specified"
#endif

/**
 * @brief   PLL3MUL field.
 */
#if ((GD32_PLL3MUL_VALUE >= 8) && (GD32_PLL3MUL_VALUE <= 14)) ||          \
    defined(__DOXYGEN__)
#define GD32_PLL3MUL               ((GD32_PLL3MUL_VALUE - 2) << 12)
#elif (GD32_PLL3MUL_VALUE == 16)
#define GD32_PLL3MUL               (14 << 12)
#elif (GD32_PLL3MUL_VALUE == 20)
#define GD32_PLL3MUL               (15 << 12)
#else
#error "invalid GD32_PLL3MUL_VALUE value specified"
#endif

/**
 * @brief   PLL2 input frequency.
 */
#define GD32_PLL2CLKIN             (GD32_HXTALCLK / GD32_PREDIV2_VALUE)

/* PLL2 input frequency range check.*/
#if (GD32_PLL2CLKIN < GD32_PLL23IN_MIN) ||                                \
    (GD32_PLL2CLKIN > GD32_PLL23IN_MAX)
#error "GD32_PLL2CLKIN outside acceptable range (GD32_PLL23IN_MIN...GD32_PLL23IN_MAX)"
#endif

/**
 * @brief   PLL2 output clock frequency.
 */
#define GD32_PLL2CLKOUT            (GD32_PLL2CLKIN * GD32_PLL2MUL_VALUE)

/**
 * @brief   PLL2 VCO clock frequency.
 */
#define GD32_PLL2VCO               (GD32_PLL2CLKOUT * 2)

