ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/hal_lld_f105_f107.h
/* PLL2 output frequency range check.*/
#if (GD32_PLL2VCO < GD32_PLL23VCO_MIN) ||                                 \
    (GD32_PLL2VCO > GD32_PLL23VCO_MAX)
#error "GD32_PLL2VCO outside acceptable range (GD32_PLL23VCO_MIN...GD32_PLL23VCO_MAX)"
#endif

/**
 * @brief   PLL3 input frequency.
 */
#define GD32_PLL3CLKIN             (GD32_HXTALCLK / GD32_PREDIV2_VALUE)

/* PLL3 input frequency range check.*/
#if (GD32_PLL3CLKIN < GD32_PLL23IN_MIN) ||                                \
    (GD32_PLL3CLKIN > GD32_PLL23IN_MAX)
#error "GD32_PLL3CLKIN outside acceptable range (GD32_PLL23IN_MIN...GD32_PLL23IN_MAX)"
#endif

/**
 * @brief   PLL3 output clock frequency.
 */
#define GD32_PLL3CLKOUT            (GD32_PLL3CLKIN * GD32_PLL3MUL_VALUE)

/**
 * @brief   PLL3 VCO clock frequency.
 */
#define GD32_PLL3VCO               (GD32_PLL3CLKOUT * 2)

/* PLL3 output frequency range check.*/
#if (GD32_PLL3VCO < GD32_PLL23VCO_MIN) ||                                 \
    (GD32_PLL3VCO > GD32_PLL23VCO_MAX)
#error "GD32_PLL3CLKOUT outside acceptable range (GD32_PLL23VCO_MIN...GD32_PLL23VCO_MAX)"
#endif

/**
 * @brief   PREDIV1 input frequency.
 */
#if (GD32_PREDIV1SRC == GD32_PREDIV1SRC_HXTAL) || defined(__DOXYGEN__)
#define GD32_PREDIV1CLK            GD32_HXTALCLK
#elif GD32_PREDIV1SRC == GD32_PREDIV1SRC_PLL2
#define GD32_PREDIV1CLK            GD32_PLL2CLKOUT
#else
#error "invalid GD32_PREDIV1SRC value specified"
#endif

/**
 * @brief   PLL input clock frequency.
 */
#if (GD32_PLLSEL == GD32_PLLSEL_PREDIV1) || defined(__DOXYGEN__)
#define GD32_PLLCLKIN              (GD32_PREDIV1CLK / GD32_PREDIV1_VALUE)
#elif GD32_PLLSEL == GD32_PLLSEL_IRC8M
#define GD32_PLLCLKIN              (GD32_IRC8MCLK / 2)
#else
#error "invalid GD32_PLLSEL value specified"
#endif

/* PLL input frequency range check.*/
#if (GD32_PLLCLKIN < GD32_PLL1IN_MIN) || (GD32_PLLCLKIN > GD32_PLL1IN_MAX)
#error "GD32_PLLCLKIN outside acceptable range (GD32_PLL1IN_MIN...GD32_PLL1IN_MAX)"
#endif

/**
 * @brief   PLL output clock frequency.
 */
#define GD32_PLLCLKOUT             (GD32_PLLCLKIN * GD32_PLLMF_VALUE)

/**
 * @brief   PLL VCO clock frequency.
 */
#define GD32_PLLVCO                (GD32_PLLCLKOUT * 2)

/* PLL output frequency range check.*/
#if (GD32_PLLVCO < GD32_PLL1VCO_MIN) || (GD32_PLLVCO > GD32_PLL1VCO_MAX)
#error "GD32_PLLVCO outside acceptable range (GD32_PLL1VCO_MIN...GD32_PLL1VCO_MAX)"
#endif

/**
 * @brief   System clock source.
 */
#if (GD32_SCS == GD32_SCS_PLL) || defined(__DOXYGEN__)
#define GD32_SYSCLK                GD32_PLLCLKOUT
#elif (GD32_SCS == GD32_SCS_IRC8M)
#define GD32_SYSCLK                GD32_IRC8MCLK
#elif (GD32_SCS == GD32_SCS_HXTAL)
#define GD32_SYSCLK                GD32_HXTALCLK
#else
#error "invalid GD32_SCS value specified"
#endif

/* Check on the system clock.*/
#if GD32_SYSCLK > GD32_SYSCLK_MAX
#error "GD32_SYSCLK above maximum rated frequency (GD32_SYSCLK_MAX)"
#endif

/**
 * @brief   AHB frequency.
 */
#if (GD32_AHBPSC == GD32_AHBPSC_DIV1) || defined(__DOXYGEN__)
#define GD32_HCLK                  (GD32_SYSCLK / 1)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV2
#define GD32_HCLK                  (GD32_SYSCLK / 2)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV4
#define GD32_HCLK                  (GD32_SYSCLK / 4)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV8
#define GD32_HCLK                  (GD32_SYSCLK / 8)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV16
#define GD32_HCLK                  (GD32_SYSCLK / 16)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV64
#define GD32_HCLK                  (GD32_SYSCLK / 64)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV128
#define GD32_HCLK                  (GD32_SYSCLK / 128)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV256
#define GD32_HCLK                  (GD32_SYSCLK / 256)
#elif GD32_AHBPSC == GD32_AHBPSC_DIV512
#define GD32_HCLK                  (GD32_SYSCLK / 512)
#else
#error "invalid GD32_AHBPSC value specified"
#endif

/* AHB frequency check.*/
#if GD32_HCLK > GD32_SYSCLK_MAX
#error "GD32_HCLK exceeding maximum frequency (GD32_SYSCLK_MAX)"
#endif

/**
 * @brief   APB1 frequency.
 */
#if (GD32_APB1PSC == GD32_APB1PSC_DIV1) || defined(__DOXYGEN__)
#define GD32_PCLK1                 (GD32_HCLK / 1)
#elif GD32_APB1PSC == GD32_APB1PSC_DIV2
#define GD32_PCLK1                 (GD32_HCLK / 2)
#elif GD32_APB1PSC == GD32_APB1PSC_DIV4
#define GD32_PCLK1                 (GD32_HCLK / 4)
#elif GD32_APB1PSC == GD32_APB1PSC_DIV8
#define GD32_PCLK1                 (GD32_HCLK / 8)
#elif GD32_APB1PSC == GD32_APB1PSC_DIV16
#define GD32_PCLK1                 (GD32_HCLK / 16)
#else
#error "invalid GD32_APB1PSC value specified"
#endif

/* APB1 frequency check.*/
#if GD32_PCLK1 > GD32_PCLK1_MAX
#error "GD32_PCLK1 exceeding maximum frequency (GD32_PCLK1_MAX)"
#endif

/**
 * @brief   APB2 frequency.
 */
#if (GD32_APB2PSC == GD32_APB2PSC_DIV1) || defined(__DOXYGEN__)
#define GD32_PCLK2                 (GD32_HCLK / 1)
#elif GD32_APB2PSC == GD32_APB2PSC_DIV2
#define GD32_PCLK2                 (GD32_HCLK / 2)
#elif GD32_APB2PSC == GD32_APB2PSC_DIV4
#define GD32_PCLK2                 (GD32_HCLK / 4)
#elif GD32_APB2PSC == GD32_APB2PSC_DIV8
#define GD32_PCLK2                 (GD32_HCLK / 8)
#elif GD32_APB2PSC == GD32_APB2PSC_DIV16
#define GD32_PCLK2                 (GD32_HCLK / 16)
#else
#error "invalid GD32_APB2PSC value specified"
#endif

/* APB2 frequency check.*/
#if GD32_PCLK2 > GD32_PCLK2_MAX
#error "GD32_PCLK2 exceeding maximum frequency (GD32_PCLK2_MAX)"
#endif

/**
 * @brief   RTC clock.
 */
#if (GD32_RTCSEL == GD32_RTCSEL_LXTAL) || defined(__DOXYGEN__)
#define GD32_RTCCLK                GD32_LXTALCLK
#elif GD32_RTCSEL == GD32_RTCSEL_IRC40K
#define GD32_RTCCLK                GD32_IRC40KCLK
#elif GD32_RTCSEL == GD32_RTCSEL_HXTALDIV
#define GD32_RTCCLK                (GD32_HXTALCLK / 128)
#elif GD32_RTCSEL == GD32_RTCSEL_NOCLOCK
#define GD32_RTCCLK                0
#else
#error "invalid source selected for RTC clock"
#endif

/**
 * @brief   ADC frequency.
 */
#if (GD32_ADCPSC == GD32_ADCPSC_DIV2) || defined(__DOXYGEN__)
#define GD32_ADCCLK                (GD32_PCLK2 / 2)
#elif GD32_ADCPSC == GD32_ADCPSC_DIV4
#define GD32_ADCCLK                (GD32_PCLK2 / 4)
#elif GD32_ADCPSC == GD32_ADCPSC_DIV6
#define GD32_ADCCLK                (GD32_PCLK2 / 6)
#elif GD32_ADCPSC == GD32_ADCPSC_DIV8
#define GD32_ADCCLK                (GD32_PCLK2 / 8)
#else
#error "invalid GD32_ADCPSC value specified"
#endif

/* ADC frequency check.*/
#if GD32_ADCCLK > GD32_ADCCLK_MAX
#error "GD32_ADCCLK exceeding maximum frequency (GD32_ADCCLK_MAX)"
#endif

/**
 * @brief   OTG frequency.
 */
#if (GD32_USBFSPRE == GD32_USBFSPRE_DIV3) || defined(__DOXYGEN__)
#define GD32_USBFSCLK              (GD32_PLLVCO / 3)
#elif (GD32_USBFSPRE == GD32_USBFSPRE_DIV2)
#define GD32_USBFSCLK              (GD32_PLLVCO / 2)
#else
#error "invalid GD32_USBFSPRE value specified"
#endif

/**
 * @brief   Timers 2, 3, 4, 5, 6, 7 clock.
 */
#if (GD32_APB1PSC == GD32_APB1PSC_DIV1) || defined(__DOXYGEN__)
#define GD32_TIMCLK1               (GD32_PCLK1 * 1)
#else
#define GD32_TIMCLK1               (GD32_PCLK1 * 2)
#endif

/**
 * @brief   Timers 1, 8 clock.
 */
#if (GD32_APB2PSC == GD32_APB2PSC_DIV1) || defined(__DOXYGEN__)
#define GD32_TIMCLK2               (GD32_PCLK2 * 1)
#else
#define GD32_TIMCLK2               (GD32_PCLK2 * 2)
#endif

/**
 * @brief   Flash settings.
 */
#if (GD32_HCLK <= 24000000) || defined(__DOXYGEN__)
#define GD32_FLASHBITS             0x00000010
#elif GD32_HCLK <= 48000000
#define GD32_FLASHBITS             0x00000011
#else
#define GD32_FLASHBITS             0x00000012
#endif

#endif /* _HAL_LLD_F105_F107_H_ */

/** @} */
